In [1]:
import pandas as pd

### 데이터 병합
- concat , merge 
- 데이터 병합 진행
- concat 
- axis 축을 뜻함
- ignore_index 인덱스를 사용할 것인지, 혹은 새로운 인덱스를 사용할 것인지?

# concat

In [12]:
df1 = pd.DataFrame({'sid':[1,2,3],'sname':['Kim','Jeon','Ryu']})
df2 = pd.DataFrame({'sid':[4,5,6],'sname':['Woo','Park','Lee']})

In [13]:
df1

   sid sname
0    1   Kim
1    2  Jeon
2    3   Ryu

In [14]:
df2

   sid sname
0    4   Woo
1    5  Park
2    6   Lee

In [15]:
pd.concat([df1,df2], axis=0, ignore_index=False)

   sid sname
0    1   Kim
1    2  Jeon
2    3   Ryu
0    4   Woo
1    5  Park
2    6   Lee

In [17]:
pd.concat([df1,df2], axis=0, ignore_index=True)
# ignore_index가 true일 때 false일 때 차이

   sid sname
0    1   Kim
1    2  Jeon
2    3   Ryu
3    4   Woo
4    5  Park
5    6   Lee

# merge

In [24]:
df1 = pd.DataFrame({'sid':[1,2,3],'sname':['Kim','Jeon','Ryu']})
df2 = pd.DataFrame({'sid':[1,2,3],'cid':['001-A','002-1','020-B']})
df3 = pd.DataFrame({'cid':['001-A','002-1','020-B'],'cname':['기초데이터베이스','자료구조및프로그래밍','오토마타']})

In [20]:
display(df1)
display(df2)
display(df3)

   sid sname
0    1   Kim
1    2  Jeon
2    3   Ryu

   sid    cid
0    1  001-A
1    2  002-1
2    3  020-B

     cid       cname
0  001-A    기초데이터베이스
1  002-1  자료구조및프로그래밍
2  020-B        오토마타

In [27]:
tmp = pd.merge(df1,df2,on='sid')
tmp

   sid sname    cid
0    1   Kim  001-A
1    2  Jeon  002-1
2    3   Ryu  020-B

In [22]:
df1 = pd.DataFrame({'sid':[1,2,4],'sname':['Kim','Jeon','Ryu']})
# sid 컬럼 하나 바꾸기

In [23]:
pd.merge(df1,df2,on='sid')
# join은 같은 컬럼에 대해서만 보여줌 ~ natural join

   sid sname    cid
0    1   Kim  001-A
1    2  Jeon  002-1

In [28]:
pd.merge(tmp,df3,on= 'cid')
# 데이터 프레임 전부 합치기 with tmp

   sid sname    cid       cname
0    1   Kim  001-A    기초데이터베이스
1    2  Jeon  002-1  자료구조및프로그래밍
2    3   Ryu  020-B        오토마타

## 2개의 컬럼 병합

In [32]:
df1 = pd.DataFrame({'sid':[1,2,3],'sname':['Kim','Jeon','Ryu'],'address':['창원','고양','마산']})
df2 = pd.DataFrame({'sid':[1,3,4],'sname':['Kim','Ryu','Woo'],'cname':['기초데이터베이스','오토마타','기계학습기초']})
display(df1)
display(df2)

   sid sname address
0    1   Kim      창원
1    2  Jeon      고양
2    3   Ryu      마산

   sid sname     cname
0    1   Kim  기초데이터베이스
1    3   Ryu      오토마타
2    4   Woo    기계학습기초

In [33]:
pd.merge(df1,df2,on=['sid','sname'])
# on의 디폴트 값 = inner , natural join 따라서 같은 컬럼만 가진 값만 보여줌

   sid sname address     cname
0    1   Kim      창원  기초데이터베이스
1    3   Ryu      마산      오토마타

In [34]:
pd.merge(df1,df2,on=['sid','sname'],how = 'outer')
# outer로 설정 시 전부 출력 => 빈 값 NaN

   sid sname address     cname
0    1   Kim      창원  기초데이터베이스
1    2  Jeon      고양       NaN
2    3   Ryu      마산      오토마타
3    4   Woo     NaN    기계학습기초

In [35]:
pd.merge(df1,df2,on=['sid','sname'],how='left')
# left = 여기서는 df1 중심으로 join, 따라서 sid =4 인 행은 탈락

   sid sname address     cname
0    1   Kim      창원  기초데이터베이스
1    2  Jeon      고양       NaN
2    3   Ryu      마산      오토마타

In [36]:
pd.merge(df1,df2,on=['sid','sname'],how='right')
# right = 여기서는 df2 중심 join 따라서 sid = 2 인 행 버려짐

   sid sname address     cname
0    1   Kim      창원  기초데이터베이스
1    3   Ryu      마산      오토마타
2    4   Woo     NaN    기계학습기초